{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?",
        "Greetings!",
        "Hello! How's your day going?",
        "Hey! Nice to see you",
        "Hi! What brings you here?",
        "Hello, how are things on your end?",
        "Hi there! Ready for a chat?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye", "Farewell", "Take care", "Until next time"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon.",
        "Farewell! Take care",
        "Until next time! Goodbye",
        "Goodbye! Have a great day",
        "Bye-bye! Stay safe",
        "See you soon!",
        "Take care! Farewell",
        "Adios! Until next time"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thank's a lot!",
        "Appreciate it",
        "You're a lifesaver",
        "Thanks a bunch",
        "Thank you so much",
        "You've been great",
        "I'm grateful"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure",
        "You're welcome!",
        "Glad I could assist",
        "No problem at all",
        "It's my pleasure",
        "Don't mention it",
        "You're always welcome",
        "Always here for you"
      ]
    },
    {
      "tag": "items",
      "patterns": [
        "Which items do you have?",
        "What kinds of items are there?",
        "What do you sell?",
        "What's on the menu?",
        "Can you list your items?",
        "I'm interested in your offerings",
        "What's available for purchase?",
        "What healthy products do you offer?",
        "Give me information about your items"
      ],
      "responses": [
        "We sell fresh and healthy products for eating and drinking.",
        "We have healthy drinks and fresh food",
        "Explore our selection of nutritious items.",
        "Discover our range of fresh and wholesome products.",
        "From healthy snacks to refreshing beverages, we've got it all.",
        "Check out our menu for a list of nutritious options.",
        "We focus on providing wholesome and delicious choices.",
        "Our offerings include a variety of items to support a healthy lifestyle.",
        "Explore our store for a diverse range of healthy products.",
        "Discover the goodness in our selection of fresh and nutritious items."
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "Do you take credit cards?",
        "Do you accept Mastercard?",
        "Can I pay with Paypal?",
        "Are you cash only?"
      ],
      "responses": [
        "We accept VISA, Mastercard and Paypal",
        "We accept most major credit cards, and Paypal"
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "How long does delivery take?",
        "How long does shipping take?",
        "When do I get my delivery?"
      ],
      "responses": [
        "Delivery takes 2-4 days",
        "Shipping takes 2-4 days"
      ]
    },
    {
      "tag": "magda",
      "patterns": [
        "Who is the smartest in the world?",
        "Who is the prettiest in the world?"
      ],
      "responses": [
        "Magda is the prettiest",
        "Magda is the smartest"
      ]
    },
    {
      "tag": "AI",
      "patterns": [
        "How AI works?",
        "What is AI?",
        "How to use AI here?",
        "How does AI work?",
        "Explain AI to me",
        "Tell me about Artificial Intelligence",
        "What are the capabilities of AI?",
        "How is AI used in this application?",
        "What are the functions of AI here?",
        "In what ways is AI implemented?",
        "Can you elaborate on AI technology?",
        "How does the AI recommendation system function?",
        "What tasks can the AI perform?"
      ],
      "responses": [
        "Artificial Intelligence (AI) works by simulating human intelligence in machines. It involves the creation of algorithms and models that enable machines to perform tasks that typically require human intelligence.",
        "Artificial Intelligence refers to the development of computer systems that can perform tasks that typically require human intelligence. These tasks include problem-solving, speech recognition, learning, planning, and decision-making. AI can be categorized into two main types: Narrow AI (or Weak AI), which is designed for a specific task, and General AI (or Strong AI), which would have the ability to perform any intellectual task that a human being can.",
	    "You can either talk with me (AI ChatBot) or use the reccomendation system at top of the page to generate a personal diet.",
        "Artificial Intelligence (AI) works by simulating human intelligence in machines. It involves the creation of algorithms and models that enable machines to perform tasks that typically require human intelligence.",
    "Artificial Intelligence refers to the development of computer systems that can perform tasks that typically require human intelligence. These tasks include problem-solving, speech recognition, learning, planning, and decision-making. AI can be categorized into two main types: Narrow AI (or Weak AI), which is designed for a specific task, and General AI (or Strong AI), which would have the ability to perform any intellectual task that a human being can.",
    "You can either talk with me (AI ChatBot) or use the recommendation system at the top of the page to generate a personal diet.",
    "AI is designed to mimic human cognitive functions and can analyze data, learn from patterns, and make decisions. In this application, AI is employed to enhance user interactions and provide personalized recommendations for a healthier lifestyle.",
    "The AI in this system utilizes advanced algorithms to process user input, understand context, and generate intelligent responses. It continuously learns from user interactions to improve its performance over time.",
    "The AI recommendation system is based on machine learning models trained on a variety of nutritional data. It considers individual preferences, dietary restrictions, and health goals to suggest personalized diet plans and product recommendations.",
    "AI plays a key role in optimizing business management by providing insights into customer preferences, automating tasks, and enhancing decision-making processes.",
    "This application leverages AI for efficient data analysis, enabling dynamic adjustments to product offerings based on market trends and user feedback.",
    "AI technologies like natural language processing (NLP) enable seamless communication with the chatbot, making it a user-friendly interface for information retrieval and interaction.",
    "Explore the capabilities of AI by engaging with the chatbot or exploring the recommendation system. AI is here to assist and enhance your experience!"
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?",
        "Make me laugh!",
    "I need a good laugh!",
    "Humor me!",
    "Share a funny story!"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison.",
        "Why don't scientists trust atoms? Because they make up everything!",
    "I used to play piano by ear, but now I use my hands and fingers.",
    "Did you hear about the mathematician who's afraid of negative numbers? He'll stop at nothing to avoid them.",
    "What do you get when you cross a snowman and a vampire? Frostbite.",
    "Why don't skeletons fight each other? They don't have the guts!",
    "Parallel lines have so much in common. It's a shame they'll never meet.",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "Why did the scarecrow win an award? Because he was outstanding in his field!",
    "I only know 25 letters of the alphabet. I don't know y.",
    "What did one wall say to the other wall? 'I'll meet you at the corner.'"
      ]
    }
  ]
}
